## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-7b2569fa492dce325e35e777e7ebacee.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source must be replaced
-/+ resource "google_storage_bucket_object" "scoring_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "yCbjnQ==" -> (known after apply)
      ~ detect_md5hash   = "eyVp+kktzjJeNed35+us7g==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1763705595311361 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-7b2569fa492dce325e35e777e7ebacee.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "eyVp+kktzjJeNed35+us7g==" -> (known after apply)
      ~ md5hexhash       = "7b2569fa492dce325e35e777e7ebacee" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-7b2569fa492dce325e35e777e7ebacee.zip?generation=1763705595311361&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/scoring-7b2569fa492dce325e35e777e7ebacee.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/scoring-7b2569fa492dce325e35e777e7ebacee.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-7b2569fa492dce325e35e777e7ebacee.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/scoring-20251121061314.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source must be replaced
-/+ resource "google_storage_bucket_object" "webhook_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "3+gXJg==" -> (known after apply)
      ~ detect_md5hash   = "/6alR7oxjSYx3BOD3/m0tw==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1763705594510514 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "/6alR7oxjSYx3BOD3/m0tw==" -> (known after apply)
      ~ md5hexhash       = "ffa6a547ba318d2631dc1383dff9b4b7" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-ffa6a547ba318d2631dc1383dff9b4b7.zip?generation=1763705594510514&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/webhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-ffa6a547ba318d2631dc1383dff9b4b7.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/webhook-20251121061314.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
